<template>
	<div class=" max-h-[28rem] min-h-72 overflow-y-scroll">
		<p class="text-sm font-normal px-4 text-justify leading-6">
			سفارش محدود یک نوع سفارش در ترید صرافی‌های آنلاین ارز دیجیتال است که به شما اجازه می‌دهد ارز دیجیتال را به قیمتی که خود تعیین کرده‌اید خرید یا فروش کنید. در این نوع سفارش، شما مشخص می‌کنید که می‌خواهید ارز دیجیتال را به یک قیمت خاص بخرید یا به یک قیمت خاص بفروشید و منتظر می‌مانید تا قیمت ارز به آن مقدار برسد و سفارش شما اجرا شود.
		</p>
		<img
			src="/images/spot/limitedOrderChart.png"
			alt="limitedOrder"
			class="px-4 my-4"
		>
		<p class="text-sm font-normal px-4 text-justify leading-6">
			برای توضیح بهتر، در نظر بگیرید که می‌خواهید بیتکوین را به قیمتی خاص بخرید. فرض کنید قیمت فعلی بیتکوین 40,000 دلار است و شما می‌خواهید آن را با قیمت 35,000 دلار بخرید. در این صورت، شما یک سفارش محدود برای خرید بیتکوین با قیمت 35,000 دلار و تعداد مورد نظر را در صرافی آنلاین ثبت می‌کنید. سپس منتظر می‌مانید تا قیمت بیتکوین به 35,000 دلار برسد. در صورتی که قیمت به این مقدار برسد، سفارش شما به صورت خودکار اجرا می‌شود و بیتکوین مورد نظر شما به حساب شما منتقل می‌شود.
		</p>
	</div>
</template>

<script setup lang="ts">

</script>
