<template>
	<div class="max-h-[28rem] min-h-72 overflow-y-scroll">
		<p class="text-sm font-normal px-4 text-justify leading-6">
			سفارش با حد سود و ضرر یک نوع سفارش در ترید صرافی‌های آنلاین ارز دیجیتال است که به شما اجازه می‌دهد سفارش خود را با تعیین یک سطح سود و یک سطح ضرر ثبت کنید. با استفاده از این نوع سفارش، شما می‌توانید مقداری از سود خود را حفظ کنید و در عین حال مقداری از ضرر را محدود کنید.
		</p>
		<img
			src="/images/spot/profitLossLimitChart.png"
			alt="profitLossLimitChart"
			class="px-4 my-4"
		>
		<p class="text-sm font-normal px-4 text-justify leading-6">
			برای توضیح، فرض کنید شما بیتکوین را به قیمت فعلی 50,000 دلار خریداری کرده‌اید و می‌خواهید در صورت کاهش قیمت به زیر 45,000 دلار، از سرمایه خود حفاظت کنید. در این صورت، شما یک سفارش Stop-Loss با سطح ضرر 45,000 دلار و تعداد مورد نظر را در صرافی آنلاین ثبت می‌کنید. اگر قیمت بیتکوین به 45,000 دلار یا پایین‌تر برسد، سفارش شما به صورت خودکار اجرا می‌شود و بیتکوین شما به قیمت فعلی بازار به فروش می‌رسد، از سرمایه خود حفاظت می‌کنید و ضرر کمتری را تجربه می‌کنید.
		</p>
	</div>
</template>

<script setup lang="ts">

</script>
