<template>
	<div class=" max-h-[28rem] min-h-72 overflow-y-scroll">
		<p class="text-base font-medium px-4 text-justify">
			سفارش محدود یک نوع سفارش در ترید صرافی‌های آنلاین ارز دیجیتال است که به شما اجازه می‌دهد ارز دیجیتال را به قیمتی که خود تعیین کرده‌اید خرید یا فروش کنید. در این نوع سفارش، شما مشخص می‌کنید که می‌خواهید ارز دیجیتال را به یک قیمت خاص بخرید یا به یک قیمت خاص بفروشید و منتظر می‌مانید تا قیمت ارز به آن مقدار برسد و سفارش شما اجرا شود.
		</p>
		<img
			src="/images/spot/urgentchart.png"
			alt="urgentchart"
			class="px-4"
		>
		<p class="text-base font-medium px-4 text-justify">
			همچنین، مثالی برای سفارش محدود برای فروش را نیز بیاوریم. فرض کنید شما بیتکوین در اختیار دارید و می‌خواهید آن را به قیمتی خاص بفروشید. قیمت فعلی بیتکوین 50,000 دلار است و شما می‌خواهید آن را با قیمت 55,000 دلار بفروشید. در این صورت، شما یک سفارش محدود برای فروش بیتکوین با قیمت 55,000 دلار و تعداد مورد نظر را در صرافی آنلاین ثبت می‌کنید. منتظر می‌مانید تا قیمت بیتکوین به 55,000 دلار برسد و در این صورت سفارش شما به صورت خودکار اجرا می‌شود و بیتکوین شما به فروشنده منتقل می‌شود و در ازای آن پولی به حساب شما واریز می‌شود.
		</p>
	</div>
</template>

<script setup lang="ts">

</script>
