<template>
	<div>
		<UAccordion
			:items="items"
			:ui="{
				default: {
					class: 'text-base font-bold px-4 py-3 my-2 bg-hover-light dark:bg-hover-dark hover:bg-hover-light hover:dark:bg-hover-dark text-black dark:text-white',
				},
			}"
		/>
	</div>
</template>

<script setup lang="ts">
const items = [
	{
		label: 'بنیانگذاران بیت کوین چه کسانی هستند؟',
		content: 'توکن بیت لند یک دارایی دیجیتال غیرمتمرکز است که توسط پلتفرم بیت لند بر اساس بلاک چین اتریوم توسعه یافته است. به عنوان نشانه اصلی بیت لند، اکوسیستم این توکن هر روز به تدریج بهبود می یابد تا کاربران و سازندگان را توانمند کند. تمرکز اصلی توکن بیت لند ارائه تجربه ای امن و پایدار برای کاربران و تبدیل شدن به یک رهبر صنعت است. این توکن همچنین اثبات حقوق جامعه بیت لند است. دارندگان حق رای دادن در مورد تصمیمات تجاری، انتخابات تیمی و کسب اولویت مشارکت در فعالیت ها و غیره را دارند. بیت لند همچنین به طور کامل پیشنهادهای رای گیری جامعه را پذیرفته و مکانیسم تخصیص حقوق و منافع را بر اساس نتایج رای گیری بازسازی می کند. از ژانویه 2022، 40 درصد از کل سود پلتفرم به بازخرید و سوزاندن این توکن از بازار ثانویه به صورت سه ماهه اختصاص خواهد یافت. مجموع عرضه اولیه این توکن 1 میلیارد توکن است. در حال حاضر 550 میلیون توکن از بین رفته اند و هدف 100 میلیون توکن در گردش بدون تغییر باقی مانده است. دارندگان این توکن از مزایای متعددی در بیت لند برخوردارند، مانند جوایزی برای برگزاری این توکن، رای دادن و دریافت اشتراک‌های تخفیف‌خورده، و دریافت airdrops رایگان برای رای دادن در لیست‌های جدید. علاوه بر این، این توکن دارای کاربردهای عملی است، مانند کسر 20٪ کارمزد تراکنش در پلت فرم معاملاتی bitland.ir.',
	},
	{
		label: 'بنیانگذاران بیت کوین چه کسانی هستند؟',
		content: 'توکن بیت لند یک دارایی دیجیتال غیرمتمرکز است که توسط پلتفرم بیت لند بر اساس بلاک چین اتریوم توسعه یافته است. به عنوان نشانه اصلی بیت لند، اکوسیستم این توکن هر روز به تدریج بهبود می یابد تا کاربران و سازندگان را توانمند کند. تمرکز اصلی توکن بیت لند ارائه تجربه ای امن و پایدار برای کاربران و تبدیل شدن به یک رهبر صنعت است. این توکن همچنین اثبات حقوق جامعه بیت لند است. دارندگان حق رای دادن در مورد تصمیمات تجاری، انتخابات تیمی و کسب اولویت مشارکت در فعالیت ها و غیره را دارند. بیت لند همچنین به طور کامل پیشنهادهای رای گیری جامعه را پذیرفته و مکانیسم تخصیص حقوق و منافع را بر اساس نتایج رای گیری بازسازی می کند. از ژانویه 2022، 40 درصد از کل سود پلتفرم به بازخرید و سوزاندن این توکن از بازار ثانویه به صورت سه ماهه اختصاص خواهد یافت. مجموع عرضه اولیه این توکن 1 میلیارد توکن است. در حال حاضر 550 میلیون توکن از بین رفته اند و هدف 100 میلیون توکن در گردش بدون تغییر باقی مانده است. دارندگان این توکن از مزایای متعددی در بیت لند برخوردارند، مانند جوایزی برای برگزاری این توکن، رای دادن و دریافت اشتراک‌های تخفیف‌خورده، و دریافت airdrops رایگان برای رای دادن در لیست‌های جدید. علاوه بر این، این توکن دارای کاربردهای عملی است، مانند کسر 20٪ کارمزد تراکنش در پلت فرم معاملاتی bitland.ir.',
	},
	{
		label: 'بنیانگذاران بیت کوین چه کسانی هستند؟',
		content: 'توکن بیت لند یک دارایی دیجیتال غیرمتمرکز است که توسط پلتفرم بیت لند بر اساس بلاک چین اتریوم توسعه یافته است. به عنوان نشانه اصلی بیت لند، اکوسیستم این توکن هر روز به تدریج بهبود می یابد تا کاربران و سازندگان را توانمند کند. تمرکز اصلی توکن بیت لند ارائه تجربه ای امن و پایدار برای کاربران و تبدیل شدن به یک رهبر صنعت است. این توکن همچنین اثبات حقوق جامعه بیت لند است. دارندگان حق رای دادن در مورد تصمیمات تجاری، انتخابات تیمی و کسب اولویت مشارکت در فعالیت ها و غیره را دارند. بیت لند همچنین به طور کامل پیشنهادهای رای گیری جامعه را پذیرفته و مکانیسم تخصیص حقوق و منافع را بر اساس نتایج رای گیری بازسازی می کند. از ژانویه 2022، 40 درصد از کل سود پلتفرم به بازخرید و سوزاندن این توکن از بازار ثانویه به صورت سه ماهه اختصاص خواهد یافت. مجموع عرضه اولیه این توکن 1 میلیارد توکن است. در حال حاضر 550 میلیون توکن از بین رفته اند و هدف 100 میلیون توکن در گردش بدون تغییر باقی مانده است. دارندگان این توکن از مزایای متعددی در بیت لند برخوردارند، مانند جوایزی برای برگزاری این توکن، رای دادن و دریافت اشتراک‌های تخفیف‌خورده، و دریافت airdrops رایگان برای رای دادن در لیست‌های جدید. علاوه بر این، این توکن دارای کاربردهای عملی است، مانند کسر 20٪ کارمزد تراکنش در پلت فرم معاملاتی bitland.ir.',
	},
];
</script>

<style scoped></style>
