<template>
	<div class="">
		<section class="relative">
			<PagesImageCover>
				<UContainer class=" h-full">
					<div class="w-full h-full relative flex justify-between">
						<div class="absolute top-0 md:top-40">
							<h1
								class="text-light dark:text-dark text-lg md:text-7xl font-extrabold mb-2 md:mb-8"
							>
								{{ $t("termsRules") }}
							</h1>
							<div
								class="p-3 bg-primary-gray-light dark:bg-primary-gray-dark shadow-md text-white w-full md:w-[30rem] h-auto opacity-75"
							>
								<b class="text-text-dark dark:text-text-light text-sm md:text-base">شرایط و قوانین فعالیت در بستر تبادل دارایی‌های دیجیتال بیت‌لند</b><br>
								<p
									class="text-text-dark dark:text-text-light mt-1 md:mt-4 text-sm md:text-base"
								>
									کاربران موظف هستند قبل از ثبت‌نام تمامی شرایط و قوانین را مطالعه
									نموده و صرفا در صورت پذیرش آن اقدام به ثبت نام نمایند.
								</p>
							</div>
						</div>
						<NuxtImg
							src="/images/svg/privacy.svg"
							alt="invite"
							class="absolute bottom-0 left-0 hidden md:block"
						/>
					</div>
				</UContainer>
			</PagesImageCover>
		</section>

		<section>
			<UContainer class="md:mx-8 mt-12">
				<div
					v-for="(item, index) in items"
					:key="index"
					class="mx-auto my-6 py-4 px-8 bg-primary-gray-light dark:bg-primary-gray-dark rounded-lg shadow"
				>
					<b class="pb-8 text-xl font-bold">{{ $t(item.title) }}</b>
					<ul class="list-disc list-inside pt-6">
						<li
							v-for="(desc, i) in item.description"
							:key="i"
							class="pb-4 text-base font-medium"
						>
							{{ desc }}<br>
						</li>
						<br>
					</ul>
				</div>
			</UContainer>
		</section>
		<CommonDownloadApp />
	</div>
</template>

<script setup lang="ts">
import { ref } from 'vue';

const items = ref([
	{
		title: 'generalRules',
		description: [
			' ثبت نام در بیت‌لند به این معنی است که کاربران تمامی مفاد و بندهای قوانین و شرایط را خوانده و قبول دارند.',
			'بیت‌لند موظف است تمامی تغییرات در قوانین را در این صفحه منتشر و بروزرسانی کند و کاربران قبول میکنند که ادامه استفاده آنها از سایت به معنی پذیرش و قبول هرگونه تغییر است.',
			'کاربران آگاهی خود را از ریسک های خاصی که با سرمایه گذاری در رمز ارز همراه است و بعضاً ممکن است قابل توجه باشد را اعلام می کنند و متعهد میشوند با پذیرش و قبول قوانین ذکر شده در این صفحه خطرات سرمایه گذاری در رمز ارز را قبول کرده و بیت‌لند در قبال خسارات و زیانهایی که ممکن است ناشی از سرمایه گذاری یا نگهداری رمزارز باشد مسئول نمی‌دانند.',
			'مسئولیت سود و زیان ناشی از تغییرات قیمت منحصرا برعهده کاربران می‌باشد.کاربران نمی‌توانند در صورت مفقود شدن رمزارز از بیت‌لند مطالبه حق و یا درخواست جبران خسارت نمایند.',
			'بیت‌لند میتواند در هر زمان طبق شرایط و قوانین جمهوری اسلامی ایران در مورد تغییر یا ویرایش قوانین سایت اقدام کند و کاربر حق هیچگونه اعتراضی را ندارد.',
			'بیت‌لند میتواند در هر زمان نسبت به کنترل کاربران و تشخیص تبانی و تقلب و همچنین حساب اجاره ای اقدام نماید و در صورت محرز شدن حساب کاربری فرد خاطی را با هماهنگی قضایی مسدود نماید.',
			'کاربران سایت می‌پذیرند که کلیه‌ی فعالیت‌های آن‌ها در بیت‌لند در چارچوب قوانین جمهوری اسلامی بوده و هیچ گونه فعالیتی خارج از این چارچوب انجام نخواهند داد.',
			'احراز هویت برای استفاده از خدمات بیت‌لند ضروری بوده و کاربران موظفند اطلاعات صحیح خود را بارگذاری نمایند.',
			'بدیهی است در صورت وجود هرگونه تخلف در احراز هویت، مسئولیت به عهده‌ی فرد متخلف بوده و بیت‌لند حق توقف ارائه خدمات به کاربر مذبور و ارجاع موارد تخلف به مراجع ذی صلاح را خواهد داشت.',
			'بیت‌لند خود را ملزم به حفظ اطلاعات شخصی کاربران خود می‌داند.',
			'کاربران بیت‌لند تعهد می دهند که از خدمات سایت بیت‌لند تنها برای خود استفاده نموده و مسئولیت استفاده از خدمات بیت‌لند برای فرد غیر که فرآیند احراز هویت را طی نکرده باشد به عهده کاربر خواهد بود.',
			'شماره حساب اعلام شده به سایت و همچنین آدرس کیف پول ها جهت برداشت رمزارز نیز می بایست متعلق به کاربر بوده و کاربران مجاز به دادن آدرس کیف پول متعلق به اشخاص دیگر نیستند.',
			'کاربران بیت‌لند می‌پذیرند در صورت تشخیص کارشناسان پشتیانی بیت‌لند، جهت حفظ امنیت دارایی حساب کاربریشان با اطلاع قبلی نسبت به برقراری تماس تصویری با تیم بیت‌لند همکاری نمایند.',
			'همچنین بنا به دستور نهادهای قضایی مانند پلیس فتا، ممکن است برداشت رمزارز به مدت 24 تا 72 ساعت کاری پس از زمان واریز از طریق درگاه شتابی، محدود گردد.',
			'کاربران بیت‌لند اذغان می‌دارند که از ریسک‌های مربوط به سرمایه‌گذاری در ارزهای دیجیتال مطلع بوده و با علم به این موضوع اقدام به سرمایه‌گذاری و تبادل می‌نمایند.',
			'بیت‌لند به عنوان بازار آنلاین تبادل ارزهای دیجیتال، هیچ گونه مسئولیتی در قبال نحوه‌ی معاملات کاربران و سود و زیان حاصل از آن ندارد.',
			'هرگونه سهل انگاری کاربران در حفظ اطلاعات امنیتی از جمله گذرواژه کاربر، به عهده‌ی شخص کاربر بوده و بیت‌لند هیچ مسئولیتی به عهده نخواهد داشت. اکیداً توصیه می شود از گذرواژه پیچیده و امن و کد شناسایی دوعاملی استفاده شود.',
			'بیت‌لند این اطمینان را می‌دهد که دارایی‌های کاربران را نزد خود به امانت و به بهترین شکل و با بالاترین استانداردهای امنیتی ممکن، حفظ نماید. در صورت بروز هرگونه مشکل امنیتی، بیت‌لند متعهد به جبران خسارت خواهد بود.',
			'در صورت تمایل برای برداشت ارزهای دیجیتال، مسئولیت ارائه‌ی آدرس صحیح کیف پول به عهده‌ی کاربر خواهد بود. در صورت بروز هر گونه مشکل اعم از اشتباه در ورود آدرس صحیح، نقص آدرس، مشکلات کیف پول مقصد و بلوکه شدن دارایی‌های کاربران در کیف پول مقصد، هیچ گونه مسئولیتی به عهده ی بیت‌لند نخواهد بود.',
			'بیت‌لند در مقابل واریز توکن یا کوین بر بستر اشتباه یا کوین هایی که در بیت‌لند پشتیبانی نمی شود هیچ گونه مسئولیتی نداشته و با توجه به مکانیسم ذخیره سازی سرد امکان استخراج این توکن ها با استفاده از ولت ثالث وجود ندارد. لذا مسئولیت هرگونه واریز اشتباه با خود کاربر بوده و کاربر حق هیچ گونه شکایتی را نخواهد داشت.',
			'درخواست برداشت ریال از حساب کاربری در سریع‌ترین زمان ممکن پس از ثبت، بررسی خواهد شد. زمان واریز پول به حساب کاربران بر اساس محدودیت‌های انتقال وجه بین بانکی، متفاوت خواهد بود. برای اطلاعات بیش‌تر، به قوانین انتقال وجه بین بانکی ( پایا ، ساتنا) مراجعه فرمایید.',
			'کاربر می‌پذیرد که به جز در موارد مورد تعهد بیت‌لند، حق هیچ گونه داعیه، طلب و شکایت از سایت بیت‌لند، مدیران، کارمندان و افراد مرتبط با این سایت را نخواهد داشت.',
			'اگر بیت‌لند تحت هر عنوان اشتباهاً یا من غیر حق، وجوه یا رمزارزی را به حساب کاربر منظور یا در محاسبات خود هر نوع اشتباهی نماید، هر زمان مجاز و مختار است راساً و مستقلاً و بدون انجام هیچ گونه تشریفات اداری و قضائی و دریافت اجازه کتبی از متعهد (صاحب حساب) در رفع اشتباه و برداشت از حساب‌های وی اقدام نماید و تشخیص بیت‌لند نسبت به وقوع اشتباه یا پرداخت بدون حق و لزوم برداشت از حساب معتبر خواهد بود و کاربر حق هرگونه اعتراض و ادعایی را در خصوص نحوه عملکرد بیت‌لنداز هر جهت از خود ساقط می نماید.',
			'در صورت بروز هرگونه مشکل یا ابهام در هر یک از معاملات، بیت‌لند حق دارد مستقلاً آن معامله را ابطال و دارایی‌های هر یک از طرفین را به حساب خودشان عودت دهد. بدیهی است که در صورتی که اشکال از سمت بیت‌لند باشد، موظف خواهد بود که جبران خسارت نماید و در غیراین صورت کاربر حق هرگونه اعتراض و ادعایی را در خصوص نحوه عملکرد بیت‌لند از هر جهت از خود ساقط می‌نماید.',
			'در صورت هرگونه سوء استفاده از کد ریفرال بیت‌لند در فعالیت‌های خلاف قانون، تمامی مسئولیت آن به عهده کاربر بوده و بیت‌لند هیچ گونه مسئولیتی در قبال هرگونه سوء استفاده از سیستم معرفی خود به هر نحو ندارد. همچنین بیت‌لند حق باطل کردن کد معرف و بستن حساب در صورت مشاهده هرگونه سوء استفاده بدون نیاز به دستور قضایی را خواهد داشت.',
		],
	},
	{
		title: 'authentication',
		description: [
			' خرید و فروش ارز در بیت‌لند نیاز به احراز هویت دارد و الزامی است.',
			'احراز هویت به منظور پیروی از قوانین ضد پول‌شویی و جلوگیری از سرقت اطلاعات کاربر است.',
			'کاربر موظف است اطلاعات صحیح خود را بارگذاری نماید. بدیهی است در صورت وجود هرگونه تخلف در احراز هویت، مسئولیت به عهده‌ فرد متخلف بوده و بیت‌لند حق ارجاع موارد تخلف به مراجع ذی‌صلاح را خواهد داشت.',
			'بیت‌لند خود را ملزم به حفظ اطلاعات شخصی کاربر می‌داند و اطلاعات احراز هویتی را بر بستر آفلاین (Cold Storage) نگهداری می‌کند.',
		],
	},
	{
		title: 'rate',
		description: [
			'هنگام فروش ارز به بیت‌لند، نرخی که در وب‌سایت درج شده (مرحله تاییدیه و تایید توافق نامه) نهایی است. در صورت عدم پذیرش نرخ درج شده، کاربر می‌بایست از ثبت سفارش خودداری نماید. ',
			'هنگام خرید ارز از بیت‌لند، نرخی که با مشتری بسته می‌شود بنا به زمان‌سنج درون وب‌سایت اعتبار دارد و کاربر موظف است در تایم مقرر معامله را تکمیل و پرداخت نماید.',
			'در صورتی که بدلیل پرداخت فی کم شبکه توسط کاربر، از زمان ثبت سفارش تا کانفرم (تایید) شبکه به کیف پول بیت‌لند بیش از 10 دقیقه بگذرد، سفارش قطعی نیست و مبنای محاسبه نرخ تشخیص کارشناس بیت‌لند خواهد بود.',
			'بیت‌لند هیچ مسئولیتی را در آینده در قبال نوسانات ارزش ارز قبول نخواهد کرد و صرفا نرخ لحظه‌ای معامله مرجع تعیین نرخ تتر خواهد بود.',
			'در صورت ارسال ارز و عدم ثبت تراکنش در وب‌سایت و بی‌توجهی کاربر به ثبت تراکنش و عدم دریافت کد رهگیری در وب‌سایت درصورت ثبت تراکنش با تاخیر، مبنای تعیین نرخ کارشناس بیت‌لند خواهد بود.',
		],
	},
	{
		title: 'wallet',
		description: [
			' از صحت آدرس کیف پول خودتان اطمینان حاصل نمایید. آدرس کیف پولی که درج می‌کنید را حداقل یک مرتبه چک کرده و صرفا به کپی کردن اکتفا نکنید.',
			'هنگام فروش ارز به بیت‌لند در مرحله ارسال ارز، آدرس ولت را مطابقت دهید و حتما یک مرتبه چک نمایید.',
			'هرگونه اشتباه در ارسال ارز به کیف پول اشتباه به عهده کاربر است. کاربر می‌بایست ولت ارز مورد نظر خود را جهت دریافت ارز ارسال نماید.',
			'کیف پول‌های مطمئن و رایج جهت دریافت و یا ارسال ارز استفاده نمایید.',
		],
	},
	{
		title: 'provideServices',
		description: [
			'فروش ارز به بیت‌لند تا سقف ۱۰۰،۰۰۰دلار بصورت ۲۴ساعته و اتوماتیک از طریق وب‌سایت و اپلیکیشن بیت‌لند انجام می‌شود. ',
			'خرید ارز از بیت‌لند برای هر کد ملی در ۲۴ ساعت معادل ۲۵,۰۰۰,۰۰۰ تومان بصورت ۲۴ساعته و اتوماتیک از طریق وب سایت و اپلیکیشن بیت‌لند انجام میشود.',
			'واریز ریال به کیف پول بیش از ۱۰۰.۰۰۰.۰۰۰تومان از ساعت ۹ الی ۲۳ روزهای غیرتعطیل و از طریق اکانت پشتیبانی تلگرام یا واتساپ انجام می‌شود.',
			'لطفا جهت ارتباط با کارشناس فروش برای خرید های بالای ۱۰۰ میلیون تومان حتما شماره تماس را از پشتیبانی داخل وبسایت دریافت کنید و یا با شماره تماس درج شده در وبسایت تماس بگیرید.',
			'بیت‌لند هیچگونه مسئولیتی در قبال معامله کاربران با افراد متفرقه و کلاهبردار در فضای مجازی که با نام بیت‌لند سواستفاده میکنند ندارد و از کاربران تقاضا دارد در این مسائل کمال دقت را داشته باشند.',
			'مطابق قوانین ابلاغی از سوی پلیس محترم فضای تبادل اطلاعات (فتا)، تمامی برداشت های ریالی و یا ارزی پس از گذشت (۴۸ساعت) از اولین واریز مقدور خواهد بود.',
		],
	},
]);
</script>
