<template>
	<div class="">
		<section class="relative">
			<PagesImageCover>
				<UContainer class="h-full">
					<div class="w-full h-full relative flex justify-between">
						<div class="absolute top-0 md:top-40">
							<h1
								class="text-light dark:text-dark text-lg md:text-7xl font-extrabold mb-2 md:mb-8"
							>
								{{ $t("riskAgreement") }}
							</h1>
							<div
								class="p-3 bg-primary-gray-light dark:bg-primary-gray-dark shadow-md text-white w-full md:w-[30rem] h-auto opacity-75"
							>
								<p
									class="text-text-dark dark:text-text-light mt-1 md:mt-4 text-sm md:text-base"
								>
									برای محافظت از منافع شما، بیت‌لند بدینوسیله به شما یادآوری
									می‌کند که بازار ارزهای دیجیتال در معرض خطرات بزرگی است. لطفاً
									قبل از انجام هرگونه معامله ارز دیجیتال، ریسک معاملات را درک و
									میزان تحمل خود را به دقت ارزیابی کنید.
								</p>
							</div>
						</div>
						<NuxtImg
							src="/images/svg/risk.svg"
							alt="invite"
							class="absolute bottom-0 left-0 hidden md:block"
						/>
					</div>
				</UContainer>
			</PagesImageCover>
		</section>

		<section>
			<UContainer class="md:mx-40 mt-12">
				<div
					class="mx-auto my-6 py-8 px-10 text-justify leading-loose bg-primary-gray-light dark:bg-primary-gray-dark rounded-lg shadow"
				>
					<b class="text-base md:text-xl font-bold leading-loose">نکاتی که باید در هنگام معامله دارایی های رمزنگاری شده در پلتفرم بیت
						لند توجه داشته باشید.</b>
					<p
						class="text-base font-bold mt-8 text-text-dark dark:text-text-light leading-loose"
					>
						۱- خدماتی مانند Spot، OTC، Futures، Savings، vote to-list و غیره در
						پلتفرم MEXC فقط برای کاربران معتبر MEXC (از این پس «کاربران») که KYC
						را تکمیل کرده‌اند، در دسترس است.
					</p>
					<p
						class="text-base font-bold text-text-dark dark:text-text-light leading-loose"
					>
						۲- کاربران باید KYC را تکمیل و تمام اطلاعات شخصی را تکمیل و تکمیل
						کنند.
					</p>
					<p
						class="text-base font-bold text-text-dark dark:text-text-light leading-loose"
					>
						۳- کاربران باید از حساب و رمز عبور خود به درستی محافظت کنند. حساب
						خود را به دیگران نسپارید یا حساب و رمز عبور خود را با کسی به اشتراک
						نگذارید. در غیر این صورت هرگونه ضرر و زیان به عهده خود کاربران خواهد
						بود.
					</p>
					<p
						class="text-base font-bold text-text-dark dark:text-text-light leading-loose"
					>
						۴- کاربران MEXC ممکن است در معرض خطرات زیر باشند:
					</p>
					<ul class="list-disc mt-8">
						<li>
							ثبت نام در بیت‌لند به این معنی است که کاربران تمامی مفاد و بندهای
							قوانین و شرایط را خوانده و قبول دارند.
						</li>
						<br>
						<li>
							بیت‌لند موظف است تمامی تغییرات در قوانین را در این صفحه منتشر و
							بروزرسانی کند و کاربران قبول میکنند که ادامه استفاده آنها از سایت
							به معنی پذیرش و قبول هرگونه تغییر است.
						</li>
						<br>
						<li>
							کاربران آگاهی خود را از ریسک های خاصی که با سرمایه گذاری در رمز
							ارز همراه است و بعضاً ممکن است قابل توجه باشد را اعلام می کنند و
							متعهد میشوند با پذیرش و قبول قوانین ذکر شده در این صفحه خطرات
							سرمایه گذاری در رمز ارز را قبول کرده و بیت‌لند در قبال خسارات و
							زیانهایی که ممکن است ناشی از سرمایه گذاری یا نگهداری رمزارز باشد
							مسئول نمی‌دانند.
						</li>
						<br>
						<li>
							مسئولیت سود و زیان ناشی از تغییرات قیمت منحصرا برعهده کاربران
							می‌باشد.کاربران نمی‌توانند در صورت مفقود شدن رمزارز از بیت‌لند
							مطالبه حق و یا درخواست جبران خسارت نمایند.
						</li>
						<br>
						<li>
							بیت‌لند میتواند در هر زمان طبق شرایط و قوانین جمهوری اسلامی ایران
							در مورد تغییر یا ویرایش قوانین سایت اقدام کند و کاربر حق هیچگونه
							اعتراضی را ندارد.
						</li>
						<br>
						<li>
							بیت‌لند میتواند در هر زمان نسبت به کنترل کاربران و تشخیص تبانی و
							تقلب و همچنین حساب اجاره ای اقدام نماید و در صورت محرز شدن حساب
							کاربری فرد خاطی را با هماهنگی قضایی مسدود نماید.
						</li>
						<br>
						<li>
							کاربران سایت می‌پذیرند که کلیه‌ی فعالیت‌های آن‌ها در بیت‌لند در
							چارچوب قوانین جمهوری اسلامی بوده و هیچ گونه فعالیتی خارج از این
							چارچوب انجام نخواهند داد.
						</li>
						<br>
						<li>
							احراز هویت برای استفاده از خدمات بیت‌لند ضروری بوده و کاربران
							موظفند اطلاعات صحیح خود را بارگذاری نمایند.
						</li>
						<br>
						<li>
							بدیهی است در صورت وجود هرگونه تخلف در احراز هویت، مسئولیت به
							عهده‌ی فرد متخلف بوده و بیت‌لند حق توقف ارائه خدمات به کاربر مذبور
							و ارجاع موارد تخلف به مراجع ذی صلاح را خواهد داشت.
						</li>
						<br>
						<li>
							بیت‌لند خود را ملزم به حفظ اطلاعات شخصی کاربران خود می‌داند.
						</li>
						<br>
						<li>
							کاربران بیت‌لند تعهد می دهند که از خدمات سایت بیت‌لند تنها برای
							خود استفاده نموده و مسئولیت استفاده از خدمات بیت‌لند برای فرد غیر
							که فرآیند احراز هویت را طی نکرده باشد به عهده کاربر خواهد بود.
						</li>
						<br>
						<li>
							شماره حساب اعلام شده به سایت و همچنین آدرس کیف پول ها جهت برداشت
							رمزارز نیز می بایست متعلق به کاربر بوده و کاربران مجاز به دادن
							آدرس کیف پول متعلق به اشخاص دیگر نیستند.
						</li>
						<br>
						<li>
							کاربران بیت‌لند می‌پذیرند در صورت تشخیص کارشناسان پشتیانی بیت‌لند،
							جهت حفظ امنیت دارایی حساب کاربریشان با اطلاع قبلی نسبت به برقراری
							تماس تصویری با تیم بیت‌لند همکاری نمایند.
						</li>
						<br>
						<li>
							همچنین بنا به دستور نهادهای قضایی مانند پلیس فتا، ممکن است برداشت
							رمزارز به مدت 24 تا 72 ساعت کاری پس از زمان واریز از طریق درگاه
							شتابی، محدود گردد.
						</li>
						<br>
						<li>
							کاربران بیت‌لند اذغان می‌دارند که از ریسک‌های مربوط به
							سرمایه‌گذاری در ارزهای دیجیتال مطلع بوده و با علم به این موضوع
							اقدام به سرمایه‌گذاری و تبادل می‌نمایند.
						</li>
						<br>
						<li>
							بیت‌لند به عنوان بازار آنلاین تبادل ارزهای دیجیتال، هیچ گونه
							مسئولیتی در قبال نحوه‌ی معاملات کاربران و سود و زیان حاصل از آن
							ندارد.
						</li>
						<br>
						<li>
							هرگونه سهل انگاری کاربران در حفظ اطلاعات امنیتی از جمله گذرواژه
							کاربر، به عهده‌ی شخص کاربر بوده و بیت‌لند هیچ مسئولیتی به عهده
							نخواهد داشت. اکیداً توصیه می شود از گذرواژه پیچیده و امن و کد
							شناسایی دوعاملی استفاده شود.
						</li>
						<br>
						<li>
							بیت‌لند این اطمینان را می‌دهد که دارایی‌های کاربران را نزد خود به
							امانت و به بهترین شکل و با بالاترین استانداردهای امنیتی ممکن، حفظ
							نماید. در صورت بروز هرگونه مشکل امنیتی، بیت‌لند متعهد به جبران
							خسارت خواهد بود.
						</li>
						<br>
						<li>
							در صورت تمایل برای برداشت ارزهای دیجیتال، مسئولیت ارائه‌ی آدرس
							صحیح کیف پول به عهده‌ی کاربر خواهد بود. در صورت بروز هر گونه مشکل
							اعم از اشتباه در ورود آدرس صحیح، نقص آدرس، مشکلات کیف پول مقصد و
							بلوکه شدن دارایی‌های کاربران در کیف پول مقصد، هیچ گونه مسئولیتی به
							عهده ی بیت‌لند نخواهد بود.
						</li>
						<br>
						<li>
							بیت‌لند در مقابل واریز توکن یا کوین بر بستر اشتباه یا کوین هایی که
							در بیت‌لند پشتیبانی نمی شود هیچ گونه مسئولیتی نداشته و با توجه به
							مکانیسم ذخیره سازی سرد امکان استخراج این توکن ها با استفاده از ولت
							ثالث وجود ندارد. لذا مسئولیت هرگونه واریز اشتباه با خود کاربر بوده
							و کاربر حق هیچ گونه شکایتی را نخواهد داشت.
						</li>
						<br>
						<li>
							درخواست برداشت ریال از حساب کاربری در سریع‌ترین زمان ممکن پس از
							ثبت، بررسی خواهد شد. زمان واریز پول به حساب کاربران بر اساس
							محدودیت‌های انتقال وجه بین بانکی، متفاوت خواهد بود. برای اطلاعات
							بیش‌تر، به قوانین انتقال وجه بین بانکی ( پایا ، ساتنا) مراجعه
							فرمایید.
						</li>
						<br>
						<li>
							کاربر می‌پذیرد که به جز در موارد مورد تعهد بیت‌لند، حق هیچ گونه
							داعیه، طلب و شکایت از سایت بیت‌لند، مدیران، کارمندان و افراد مرتبط
							با این سایت را نخواهد داشت.
						</li>
						<br>
						<li>
							اگر بیت‌لند تحت هر عنوان اشتباهاً یا من غیر حق، وجوه یا رمزارزی را
							به حساب کاربر منظور یا در محاسبات خود هر نوع اشتباهی نماید، هر
							زمان مجاز و مختار است راساً و مستقلاً و بدون انجام هیچ گونه
							تشریفات اداری و قضائی و دریافت اجازه کتبی از متعهد (صاحب حساب) در
							رفع اشتباه و برداشت از حساب‌های وی اقدام نماید و تشخیص بیت‌لند
							نسبت به وقوع اشتباه یا پرداخت بدون حق و لزوم برداشت از حساب معتبر
							خواهد بود و کاربر حق هرگونه اعتراض و ادعایی را در خصوص نحوه عملکرد
							بیت‌لنداز هر جهت از خود ساقط می نماید.
						</li>
						<br>
						<li>
							در صورت بروز هرگونه مشکل یا ابهام در هر یک از معاملات، بیت‌لند حق
							دارد مستقلاً آن معامله را ابطال و دارایی‌های هر یک از طرفین را به
							حساب خودشان عودت دهد. بدیهی است که در صورتی که اشکال از سمت بیت
							لند باشد، موظف خواهد بود که جبران خسارت نماید و در غیراین صورت
							کاربر حق هرگونه اعتراض و ادعایی را در خصوص نحوه عملکرد بیت‌لند از
							هر جهت از خود ساقط می‌نماید.
						</li>
						<br>
						<li>
							در صورت هرگونه سوء استفاده از کد ریفرال بیت‌لند در فعالیت‌های خلاف
							قانون، تمامی مسئولیت آن به عهده کاربر بوده و بیت‌لند هیچ گونه
							مسئولیتی در قبال هرگونه سوء استفاده از سیستم معرفی خود به هر نحو
							ندارد. همچنین بیت‌لند حق باطل کردن کد معرف و بستن حساب در صورت
							مشاهده هرگونه سوء استفاده بدون نیاز به دستور قضایی را خواهد داشت.
						</li>
						<br>
					</ul>
				</div>
			</UContainer>
		</section>

		<section>
			<UContainer class="md:mx-40 mt-12">
				<div
					class="mx-auto my-6 py-8 px-10 text-justify leading-loose bg-primary-gray-light dark:bg-primary-gray-dark rounded-lg shadow"
				>
					<b class="text-xl font-bold leading-loose">
						اقدامات ممنوعه در بیت‌لند:
					</b>
					<p
						class="text-base font-medium mt-8 text-text-dark dark:text-text-light leading-loose"
					>
						۱- اقداماتی مانند پولشویی، معاملات جعلی، جمع آوری وجوه غیرقانونی و
						کلاهبرداری ممنوع است. استفاده از هویت دیگران برای ثبت نام یک تخلف
						قابل ممنوع است و هرگونه کتمان یا کلاهبرداری عمدی در KYC مجاز نیست.
						در غیر این صورت، بیت‌لند این حق را دارد که مسدود کند، حساب کاربری را
						که مشکوک به تخلفات فوق الذکر است، خاتمه دهد، یا دارایی های دیجیتال
						رمزگذاری شده آنها را مخفی کند.
					</p>
					<p
						class="text-base font-medium text-text-dark dark:text-text-light leading-loose"
					>
						۲- این اطلاعیه ریسک، ماهیت کل بازار ارزهای دیجیتال را منعکس نمی کند.
						بسیاری از ریسک ها و عوامل زیان مالی دیگر وجود دارد که ذکر نشده است.
						بنابراین، باید قوانین تراکنش‌ها، تبلیغات و قراردادهای مرتبط و همچنین
						این اطلاعیه ریسک را بخوانید و کاملاً درک کنید و اطمینان حاصل کنید که
						ارزیابی‌های ریسک و ترتیبات مالی کافی را قبل از انجام معاملات ارزهای
						دیجیتال انجام داده‌اید تا از زیان‌های غیر قابل تحمل جلوگیری کنید. .
					</p>
					<p
						class="text-base font-medium text-text-dark dark:text-text-light leading-loose"
					>
						۳- ریسک های معاملاتی در بیت‌لند بر عهده خود کاربران خواهد بود. بیت
						لند هرگز به هیچ شکلی قول نداده است که کاربرانی که در بیت‌لند معامله
						می کنند با ضرر مواجه نخواهند شد.
					</p>
				</div>
			</UContainer>
		</section>

		<section>
			<UContainer class="md:mx-40 mt-12">
				<div
					class="mx-auto my-6 py-8 px-10 text-justify leading-loose bg-primary-gray-light dark:bg-primary-gray-dark rounded-lg shadow"
				>
					<b class="text-xl font-bold leading-loose"> تعهد کاربر </b>
					<p
						class="text-base font-medium mt-8 text-text-dark dark:text-text-light leading-loose"
					>
						به عنوان یک کاربر بیت‌لند، شما قول می‌دهید که هرگز قوانین و مقررات
						ملی/منطقه‌ای جمهوری خلق چین، جمهوری سنگاپور و همچنین کشورهایی را که
						کاربران از آنها منشا گرفته‌اند (محل اقامت ثبت‌شده) را نقض نخواهید
						کرد. در صورتی که شما به عنوان یک کاربر قوانین و مقررات را زیر پا
						بگذارید یا رفتار شما مکانیسم کنترل ریسک بیت‌لند را فعال کند (شامل
						اما نه محدود به ورود غیرعادی، مقدار معاملات اشتباه، خرید زیاد اما کم
						فروش، مقدار زیاد فیات برداشت و سایر تراکنش‌های غیرعادی)، شما، کاربر،
						موافقت می‌کنید که بیت‌لند حق مسدود کردن یا فسخ حساب را دارد و
						مسئولیت قانونی شما را بررسی می‌کند. هر گونه خسارت وارده و مسئولیت
						قانونی بر عهده شما، کاربر و خودتان است.
					</p>
					<div class="flex mt-8">
						<IconInfo
							class="text-primary-yellow-light dark:text-primary-yellow-dark mt-2"
						/>
						<p
							class="text-sm font-normal mr-2 text-primary-yellow-light dark:text-primary-yellow-dark leading-loose"
						>
							یادآوری: اگر برای موافقت با این اخطار خطر کلیک کنید، به نظر می رسد
							که متوجه خطرات تراکنش ارزهای دیجیتال و زیان های احتمالی هستید و
							مایل هستید که آن را قبول کنید. بیت‌لند موظف به بازپرداخت اصل و
							منافع ارز رمزنگاری شده کاربر یا پذیرفتن مسئولیت های دیگر نیست.
						</p>
					</div>
				</div>
			</UContainer>
		</section>

		<CommonDownloadApp />
	</div>
</template>

<script setup lang="ts">
import IconInfo from '~/assets/svg-icons/info.svg';
</script>
